app/controllers/profiles_controller.rb

SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = 1 LIMIT 1
---
  def index
    @profile = Profile.find(current_user.id)

INSERT INTO "profiles" ("s3_key", "s3_secret", "user_id", "created_at", "updated_at") VALUES ('AKIAJH33CIBO3SYJLDPA', 'AxcGc1lOWKGsIoFCf+efBtRRobGSJmypKPBrAWOm', 1, '2011-04-01 16:52:55.024506', '2011-04-01 16:52:55.024506') RETURNING "id"
---
  def create
    @profile = Profile.new(params[:profile])
    @profile.user_id = 1

    respond_to do |format|
      if @profile.save